import styles from "./style.module.css";
import Image from "next/image";
import Link from "next/link";
import JawlattLink from "@/components/JawlattLink";
import Header from "@/partials/header";
import Footer from "@/partials/footer";
import GoogleAds from "@/components/GoogleAds";
import Col from "react-bootstrap/Col";
import Nav from "react-bootstrap/Nav";
import Row from "react-bootstrap/Row";
import Tab from "react-bootstrap/Tab";
import MyNewsMediaCard from "@/components/myNewsMediaCard/index";
import MediaCard from "@/components/NewsMediaCard/index";
import Bitmap from "@/public/Bitmap-img.png";
import Notification from "@/public/notification-bell.png";
import Banner from "@/public/banner-page.png";
import Ads6 from "@/public/ads6.jpg";
import { wrapper } from "@/utils/store";
import { fetchServerItem, serverItemSelector } from "@/slices/serverItems";
import JawlattShopSingleIframe from "@/components/JawlattShopSingleIframe";
// import styles from './Home.css'

export const getServerSideProps = wrapper.getServerSideProps(
  (store) => async (context) => {
    await store.dispatch(fetchServerItem());
  }
);

export default function CategoryPost() {
  const formSubmit = (e) => {
    e.preventDefault();
  };
  return (
    <>
      <Header />

      <div className={styles.jawllat_policy_banner}>
        <img src={Banner?.src} alt="banner" />
      </div>
      <div className={"mb-5 " + styles.jawllat_policy_Text}>
        <div className="container">
          <div className="row">
            <div className="col-12 col-md-8">
              <div className="page-content pt-4 mb-4">
                <h4>سياسة الإستخدام</h4>
                <p className="p1">تاريخ السريان: 1 يناير 2022</p>
                <p className="p1">
                  . (“نحن” أو “نحن” أو “خاصتنا”) تقوم بتشغيل موقع jawlatt.com
                  (“الخدمة”).
                </p>
                <p className="p1">
                  تُعلمك هذه الصفحة بسياساتنا المتعلقة بجمع البيانات الشخصية
                  واستخدامها والكشف عنها عند استخدام خدمتنا والخيارات التي قمت
                  بربطها بهذه البيانات.
                </p>
                <p className="p1">
                  نستخدم بياناتك لتوفير الخدمة وتحسينها. باستخدام الخدمة ، فإنك
                  توافق على جمع واستخدام المعلومات وفقًا لهذه السياسة. عندما
                  تستخدم الخدمة ، فإنك توافق على جمع معلوماتك ونقلها ومعالجتها
                  وتخزينها والكشف عنها واستخدامات أخرى كما هو موضح في سياسة
                  الخصوصية هذه. ما لم يتم تحديد خلاف ذلك في سياسة الخصوصية هذه ،
                  فإن المصطلحات المستخدمة في سياسة الخصوصية هذه لها نفس المعاني
                  كما في الشروط والأحكام الخاصة بنا.
                </p>
                <p className="p1">تعريفات</p>
                <p className="p1">
                  <strong>خدمة</strong>
                </p>
                <p className="p1">تعني الخدمة موقع jawlatt.com</p>
                <p className="p1">
                  <strong>بيانات شخصية</strong>
                </p>
                <p className="p1">
                  البيانات الشخصية تعني البيانات المتعلقة بفرد على قيد الحياة
                  يمكن تحديد هويته من تلك البيانات (أو من تلك المعلومات وغيرها
                  سواء في حوزتنا أو من المحتمل أن تكون في حوزتنا).
                </p>
                <p className="p1">
                  <strong>بيانات الاستخدام</strong>
                </p>
                <p className="p1">
                  بيانات الاستخدام هي البيانات التي يتم جمعها تلقائيًا إما عن
                  طريق استخدام الخدمة أو من البنية التحتية للخدمة نفسها (على
                  سبيل المثال ، مدة زيارة الصفحة).
                </p>
                <p className="p1">
                  <strong>كوكيز</strong>
                </p>
                <p className="p1">
                  ملفات تعريف الارتباط هي أجزاء صغيرة من البيانات المخزنة على
                  جهازك (الكمبيوتر أو الجهاز المحمول).
                </p>
                <p className="p1">
                  <strong>متحكم بيانات</strong>
                </p>
                <p className="p1">
                  يُقصد بمراقب البيانات الشخص الطبيعي أو الاعتباري الذي (إما
                  بمفرده أو بالاشتراك مع أشخاص آخرين) يحدد الأغراض والطريقة التي
                  تتم بها معالجة أي معلومات شخصية أو يتعين معالجتها.
                </p>
                <p className="p1">
                  لغرض سياسة الخصوصية هذه ، نحن مراقب بيانات لبياناتك الشخصية.
                </p>
                <p className="p1">
                  <strong>معالجي البيانات (أو مزودي الخدمة)</strong>
                </p>
                <p className="p1">
                  يُقصد بمعالج البيانات (أو مزود الخدمة) أي شخص طبيعي أو اعتباري
                  يقوم بمعالجة البيانات نيابة عن مراقب البيانات.
                </p>
                <p className="p1">
                  قد نستخدم خدمات مختلف مقدمي الخدمة من أجل معالجة بياناتك بشكل
                  أكثر فعالية.
                </p>
                <p className="p1">
                  <strong>موضوع البيانات (أو المستخدم)</strong>
                </p>
                <p className="p1">
                  موضوع البيانات هو أي فرد على قيد الحياة يستخدم خدمتنا ويكون
                  موضوع البيانات الشخصية.
                </p>
                <p className="p1">
                  <strong>جمع المعلومات واستخدامها</strong>
                </p>
                <p className="p1">
                  نقوم بجمع عدة أنواع مختلفة من المعلومات لأغراض مختلفة لتوفير
                  وتحسين خدماتنا لك.
                </p>
                <p className="p1">
                  <strong>أنواع البيانات المجمعة</strong>
                </p>
                <p className="p1">
                  <strong>بيانات شخصية</strong>
                </p>
                <p className="p1">
                  أثناء استخدام خدمتنا ، قد نطلب منك تزويدنا بمعلومات تعريف
                  شخصية معينة يمكن استخدامها للاتصال بك أو التعرف عليك
                  (“البيانات الشخصية”). تمكننا المعلومات التي نجمعها من تخصيص
                  الخدمة وتحسينها والاستمرار في تشغيلها. فيما يتعلق بجوانب معينة
                  من الخدمة ، قد نطلب بعض معلوماتك الشخصية ونجمعها ونستخدمها
                  ونشاركها و / أو نعرضها. قد تتضمن معلومات التعريف الشخصية ، على
                  سبيل المثال لا الحصر:
                </p>
                <p className="p1">عنوان بريد الكتروني</p>
                <p className="p1">الاسم الأول واسم العائلة</p>
                <p className="p1">
                  <strong>ملفات تعريف الارتباط وبيانات الاستخدام</strong>
                </p>
                <p className="p1">
                  البيانات من الشبكات الاجتماعية إذا كنت تستخدم حسابات الشبكة
                  الاجتماعية الخاصة بك للتسجيل وإنشاء حساب في الخدمة.
                </p>
                <p className="p1">
                  قد نستخدم بياناتك الشخصية لتزويدك بالأخبار ذات الصلة أو
                  الاتصال بك من خلال النشرات الإخبارية أو المواد التسويقية أو
                  الترويجية وغيرها من المعلومات التي قد تهمك. يمكنك إلغاء
                  الاشتراك في تلقي أي من هذه الاتصالات أو جميعها منا باتباع رابط
                  إلغاء الاشتراك أو الإرشادات الواردة في أي بريد إلكتروني نرسله.
                </p>
                <p className="p1">
                  <strong>بيانات الاستخدام</strong>
                </p>
                <p className="p1">
                  قد نقوم أيضًا بجمع المعلومات التي يرسلها متصفحك عندما تزور
                  خدمتنا أو عندما تصل إلى الخدمة عن طريق أو من خلال جهاز محمول
                  (“بيانات الاستخدام”).
                </p>
                <p className="p1">
                  قد تتضمن بيانات الاستخدام هذه معلومات مثل عنوان بروتوكول
                  الإنترنت لجهاز الكمبيوتر الخاص بك (مثل عنوان IP) ، ونوع
                  المتصفح ، وإصدار المتصفح ، وصفحات الخدمة التي تزورها ، ووقت
                  وتاريخ زيارتك ، والوقت الذي تقضيه على تلك الصفحات ، فريد
                  معرّفات الجهاز وبيانات التشخيص الأخرى.
                </p>
                <p className="p1">
                  عند الوصول إلى الخدمة عن طريق أو من خلال جهاز محمول ، قد تتضمن
                  بيانات الاستخدام هذه معلومات مثل نوع الجهاز المحمول الذي
                  تستخدمه ، والمعرف الفريد لجهازك المحمول ، وعنوان IP لجهازك
                  المحمول ، ونظام تشغيل هاتفك المحمول ، ونوع مستعرض الإنترنت
                  للجوال الذي تستخدمه ومعرّفات الأجهزة الفريدة ومعرّفات
                  الإعلانات الفريدة وبيانات التشخيص الأخرى.
                </p>
                <p className="p1">بيانات الموقع</p>
                <p className="p1">
                  يجوز لنا استخدام وتخزين معلومات حول موقعك (“بيانات الموقع”).
                  نستخدم هذه البيانات لتوفير ميزات خدمتنا ولتوصيل الأخبار ذات
                  الصلة إليك ، وكذلك لتحسين خدمتنا وتخصيصها.
                </p>
                <p className="p1">
                  <strong>البيانات من الشبكات الاجتماعية</strong>
                </p>
                <p className="p1">
                  معلومات المستخدم من مواقع الشبكات الاجتماعية ، مثل Facebook و
                  Google+ و Twitter ، بما في ذلك اسمك واسم مستخدم الشبكة
                  الاجتماعية والموقع والجنس وتاريخ الميلاد وعنوان البريد
                  الإلكتروني وصورة الملف الشخصي والبيانات العامة لجهات الاتصال ،
                  إذا قمت بتوصيل حسابك أو تسجيل الدخول -up للحصول على حساب في
                  الخدمة باستخدام حساباتك في هذه الشبكات الاجتماعية.
                </p>
                <p className="p1">
                  <strong>بيانات التتبع وملفات تعريف الارتباط</strong>
                </p>
                <p className="p1">
                  نحن نستخدم ملفات تعريف الارتباط وتقنيات التتبع المماثلة لتتبع
                  النشاط على خدمتنا والاحتفاظ بمعلومات معينة.
                </p>
                <p className="p3">
                  ملفات تعريف الارتباط هي ملفات تحتوي على كمية صغيرة من البيانات
                  التي قد تتضمن معرفًا فريدًا مجهول الهوية
                  <span className="s1">. </span>يتم إرسال ملفات تعريف الارتباط
                  إلى متصفحك من موقع ويب وتخزينها على جهازك
                </p>
                <strong>إفشاء البيانات</strong>
                الإفصاح عن جهات إنفاذ القانون في ظل ظروف معينة ، قد يُطلب منا
                الكشف عن بياناتك الشخصية إذا طُلب منا ذلك بموجب القانون أو
                استجابة لطلبات صحيحة من قبل السلطات العامة (على سبيل المثال ،
                محكمة أو وكالة حكومية).
                <strong>المتطلبات القانونية</strong>
                قد نكشف عن بياناتك الشخصية بحسن نية أن مثل هذا الإجراء ضروري من
                أجل:
                <strong>للامتثال لالتزام قانوني</strong>
                لحماية والدفاع عن حقوق أو ممتلكات Jawlatt Inc. لمنع أو التحقيق
                في أي مخالفات محتملة تتعلق بالخدمة لحماية السلامة الشخصية
                لمستخدمي الخدمة أو الجمهور للحماية من المسؤولية القانونية
                <strong>أمن البيانات</strong>
                يعد أمان بياناتك أمرًا مهمًا بالنسبة لنا ، ولكن تذكر أنه لا توجد
                وسيلة نقل عبر الإنترنت أو طريقة تخزين إلكتروني آمنة بنسبة 100٪.
                بينما نسعى جاهدين لاستخدام وسائل مقبولة تجاريًا لحماية بياناتك
                الشخصية ، لا يمكننا ضمان أمنها المطلق. حقوق حماية البيانات
                الخاصة بك بموجب اللائحة العامة لحماية البيانات (GDPR) إذا كنت
                مقيمًا في المنطقة الاقتصادية الأوروبية (EEA) ، فلديك بعض حقوق
                حماية البيانات. نهدف إلى اتخاذ خطوات معقولة للسماح لك بتصحيح أو
                تعديل أو حذف أو تقييد استخدام بياناتك الشخصية. إذا كنت ترغب في
                إبلاغك بالبيانات الشخصية التي نحتفظ بها عنك وإذا كنت تريد
                إزالتها من أنظمتنا ، فيرجى الاتصال بنا. في ظروف معينة ، تتمتع
                بحقوق حماية البيانات التالية: الحق في الوصول إلى المعلومات التي
                لدينا عنك أو تحديثها أو حذفها. يمكنك الوصول إلى بياناتك الشخصية
                أو تحديثها أو طلب حذفها عن طريق الاتصال بنا مباشرة. حق التصحيح.
                لديك الحق في تصحيح معلوماتك إذا كانت هذه المعلومات غير دقيقة أو
                غير كاملة. الحق في الاعتراض. يحق لك الاعتراض على معالجتنا
                لبياناتك الشخصية. حق التقييد. لديك الحق في طلب تقييد معالجة
                معلوماتك الشخصية. الحق في نقل البيانات. لديك الحق في أن يتم
                تزويدك بنسخة من المعلومات التي لدينا عنك بتنسيق منظم وقابل
                للقراءة آليًا وشائع الاستخدام. الحق في سحب الموافقة. لديك أيضًا
                الحق في سحب موافقتك في أي وقت اعتمدنا فيه على موافقتك لمعالجة
                معلوماتك الشخصية. يرجى ملاحظة أننا قد نطلب منك التحقق من هويتك
                قبل الرد على هذه الطلبات. لديك الحق في تقديم شكوى إلى هيئة حماية
                البيانات بشأن جمعنا لبياناتك الشخصية واستخدامها. لمزيد من
                المعلومات ، يرجى الاتصال بهيئة حماية البيانات المحلية في المنطقة
                الاقتصادية الأوروبية (EEA).
                <strong>مقدمي الخدمة</strong>
                يجوز لنا توظيف شركات وأفراد من أطراف ثالثة لتسهيل خدمتنا (“مزودي
                الخدمة”) ، أو لتقديم الخدمة نيابة عنا ، أو لأداء الخدمات
                المتعلقة بالخدمة أو لمساعدتنا في تحليل كيفية استخدام خدمتنا. هذه
                الأطراف الثالثة لديها حق الوصول إلى بياناتك الشخصية فقط لأداء
                هذه المهام نيابة عنا وهي ملزمة بعدم الكشف عنها أو استخدامها لأي
                غرض آخر.
                <strong>فيديو</strong>
                قد نستخدم مزودي خدمة من جهات خارجية لتوفير محتوى فيديو ووظائف
                داخل خدمتنا.
                <strong>خدمات YouTube API</strong>
                تستخدم الخدمة خدمات YouTube API. باستخدام الخدمة ، فإنك توافق
                على الالتزام بشروط خدمة YouTube
                (https://www.youtube.com/t/terms). سياسة خصوصية Google متاحة على
                https://policies.google.com/privacy. يمكنك إبطال وصول الخدمة إلى
                بيانات Google الخاصة بك في أي وقت عبر صفحة إعدادات أمان Google
                على https://security.google.com/settings/security/permissions.
                <strong>تحليلات</strong>
                قد نستخدم مزودي خدمة تابعين لجهات خارجية لمراقبة وتحليل استخدام
                خدمتنا.
                <strong>تحليلات كوكل</strong>
                Google Analytics هي خدمة تحليلات الويب التي تقدمها Google والتي
                تتعقب حركة مرور موقع الويب وتبلغ عنها. تستخدم Google البيانات
                التي تم جمعها لتتبع ومراقبة استخدام خدمتنا. تتم مشاركة هذه
                البيانات مع خدمات Google الأخرى. قد تستخدم Google البيانات التي
                تم جمعها لتهيئة إعلانات شبكة الإعلانات الخاصة بها وتخصيصها.
                لمزيد من المعلومات حول ممارسات الخصوصية الخاصة بـ Google ، يرجى
                زيارة صفحة الويب الخاصة بخصوصية وسياسة Google:
                http://www.google.com/intl/ar/policies/privacy/
                <strong>دعاية</strong>
                قد نستخدم مزودي خدمة من جهات خارجية لعرض إعلانات لك للمساعدة في
                دعم خدمتنا وصيانتها.
                <strong>جوجل ادسنس و دبل كليك كوكي</strong>
                تستخدم Google ، بصفتها بائعًا خارجيًا ، ملفات تعريف الارتباط
                لعرض الإعلانات على خدمتنا. يتيح استخدام Google لملف تعريف
                الارتباط DoubleClick لها وشركائها تقديم الإعلانات لمستخدمينا
                بناءً على زيارتهم لخدمتنا أو مواقع الويب الأخرى على الإنترنت.
                يمكنك إلغاء الاشتراك في استخدام ملف تعريف الارتباط DoubleClick
                للإعلانات القائمة على الاهتمامات من خلال زيارة صفحة ويب إعدادات
                إعلانات Google: http://www.google.com/ads/preferences/ يمكنك
                معرفة المزيد حول الإعلانات القائمة على الاهتمامات ، بما في ذلك
                كيفية إلغاء الاشتراك في إعلانات شركاء الجهات الخارجية التي تراها
                على الخدمة وعلى الخدمات الأخرى ، من خلال زيارة
                http://www.aboutads.info/choices/ و http: /
                /www.aboutads.info/appchoi
                <strong>مزودي تقنية الإعلان</strong>
                نحن نستخدم مزودي تقنية الإعلان لاختيار الإعلانات وتقديمها لك ،
                ولقياس إيصال هذه الإعلانات وفعاليتها ، بالإضافة إلى دعم توصيل
                الإعلانات وقياس الإعلانات والوظائف الأخرى. يتم أحيانًا استهداف
                هذه الإعلانات وعرضها على مستخدمين معينين. سيجمع شركاؤنا في تقنية
                الإعلان البيانات ، ويستخدمون ملفات تعريف الارتباط ، ومعرّفات
                الهاتف المحمول ومعرّفات الإعلانات لتخصيص الإعلانات وقياسها.
                لمعرفة المزيد وعرض قائمة بموفري تقنية الإعلان هؤلاء ، الرجاء
                النقر هنا. باستخدام الخدمة ، فإنك توافق وتوافق على مشاركة
                واستخدام المعلومات التي تم جمعها إلى ومن قبل مزودي تقنية الإعلان
                لدينا وفقًا لهذه السياسة.
                <strong>روابط لمواقع أخرى</strong>
                قد تحتوي خدمتنا على روابط لمواقع أخرى لا نقوم بتشغيلها. إذا قمت
                بالنقر فوق ارتباط جهة خارجية ، فسيتم توجيهك إلى موقع الطرف
                الثالث. ننصحك بشدة بمراجعة سياسة الخصوصية لكل موقع تزوره. ليس
                لدينا أي سيطرة ولا نتحمل أي مسؤولية عن المحتوى أو سياسات
                الخصوصية أو الممارسات الخاصة بأي مواقع أو خدمات خاصة بطرف ثالث.
                <strong>خصوصية الأطفال</strong>
                لا تخاطب خدمتنا أي شخص يقل عمره عن 18 عامًا (“الأطفال”). نحن لا
                نجمع عن عمد معلومات تعريف شخصية من أي شخص يقل عمره عن 18 عامًا.
                إذا كنت أحد الوالدين أو الوصي وتدرك أن أطفالك قد زودونا ببيانات
                شخصية ، فيرجى الاتصال بنا. إذا علمنا أننا جمعنا بيانات شخصية من
                الأطفال دون التحقق من موافقة الوالدين ، فإننا نتخذ خطوات لإزالة
                تلك المعلومات من خوادمنا. التغييرات على سياسة الخصوصية هذه مع
                استمرار تطوير خدمتنا ، قد نقرر مراجعة سياسة الخصوصية هذه من وقت
                لآخر. سيحكم الإصدار الأحدث استخدامنا لمعلوماتك وسيكون دائمًا على{" "}
                <a href="https://jawlatt.com/">https://jawlatt.com/privacy</a> ،
                والإصدارات الأقدم متاحة عند الطلب. إذا قمنا بإجراء تغييرات نعتقد
                أنها ستغير حقوقك بشكل كبير ، فسنخطرك عن طريق نشر إشعار على
                موقعنا. أنت توافق على قبول أي تغييرات أو مراجعات على سياسة
                الخصوصية هذه من خلال الاستمرار في استخدام خدمتنا.
                <strong>اتصل بنا</strong>
                إذا كانت لديك أي أسئلة حول سياسة الخصوصية هذه ، فيرجى الاتصال
                بنا: عن طريق البريد الإلكتروني: jawlattnews@gmail.com
              </div>
              <div className={styles.jawllat_policy_form}>
                <h4>تواصل معنا</h4>
                <form onSubmit={formSubmit}>
                  <div className="mt-4">
                    <input
                      type="text"
                      placeholder="الإسم"
                      className={styles.jwalatt_form_group}
                    />
                  </div>
                  <div className="mt-4">
                    <input
                      type="text"
                      placeholder="البريد الإلكتروني"
                      className={styles.jwalatt_form_group}
                    />
                  </div>
                  <div className="mt-4">
                    <textarea
                      placeholder="الرسالة"
                      className={styles.jwalatt_form_group}
                    />
                  </div>
                  <div className="mt-4">
                    <input type="submit" value="أرسل رسالة" />
                  </div>
                </form>
              </div>
            </div>
            <div className="col-12 col-md-1"></div>
            <div className="d-none d-lg-block col-12 col-md-3">
              <div className="full-img mb-0 mb-lg-3">
                <GoogleAds
                  id="div-gpt-ad-1686735122756-0"
                  slot="/29958771/New_Jaw_MPU_Desktop_04"
                  width={300}
                  height={250}
                />
              </div>
              <div className="full-img mb-0 mb-lg-3">
                <JawlattShopSingleIframe />
              </div>
            </div>
          </div>
        </div>
      </div>

      <Footer />
    </>
  );
}
